In [1]:
import pandas as pd
import sqlalchemy as sql
import numpy as np

In [2]:
# Create a temporary sqlite database
data_connection_string = 'sqlite:///'

In [3]:
# Create a database engine w/ "display the SQL code back in the notebook": echo = True.
engine = sql.create_engine(
    data_connection_string
)

engine

Engine(sqlite:///)

# View and create table

In [4]:
# The result is an empty "temporary SQLite database", and this is true since it was just create from code above.
engine.table_names()

C:\Users\admin\AppData\Local\Temp\ipykernel_17180\3218451222.py:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

[]

#### Use Pandas DataFrame to create a toble to later store in the SQLite database

In [5]:
stocks_df = pd.DataFrame(

 {
        'HSWF':
            np.random.randint(
                10,
                100,
                10
            )
    
,

        'KLTE':
            np.random.randint(
                100,
                1000,
                10
            )
    
,

        'BJSE':
            np.random.randint(
                10,
                100,
                10
            )
    }
)

stocks_df

   HSWF  KLTE  BJSE
0    12   727    27
1    86   917    77
2    27   806    42
3    34   903    52
4    80   256    83
5    32   779    32
6    33   519    39
7    53   512    73
8    84   681    92
9    65   201    53

# As above, the Pandas dataframe will be used as the table for the SQLite database so that the database can be query for its contents in this exercise.
# It's time to create a table of data in the SQLite.
> `to_sql ( )` w/ parameters: **'dataframe_name\', database_engine**

In [6]:
stocks_df.to_sql(
    'stocks_df',
    engine
)

10

#### Confirm that the table was written into the SQLite database

In [7]:
engine.table_names()

C:\Users\admin\AppData\Local\Temp\ipykernel_17180\4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['stocks_df']

# Create another instance of SQLite database.

In [8]:
# Create another SQLite instance
data_connection_string = 'sqlite:///mytestSQLite_database.db'

# Create an engine.
engine = sql.create_engine(
    data_connection_string
)

# Confirm database engine exists.
engine

Engine(sqlite:///mytestSQLite_database.db)

In [9]:
stocks_df = pd.DataFrame(
    {
        'UAVN': np.random.randint(10,100,10),
        'OPKS': np.random.randint(10,100,10),
        'WTUY': np.random.randint(10,100,10)
    }
)
stocks_df

   UAVN  OPKS  WTUY
0    24    20    79
1    59    72    99
2    65    55    94
3    87    46    84
4    28    60    30
5    56    74    44
6    96    72    64
7    83    62    72
8    29    61    47
9    43    37    29

In [10]:
stocks_df.to_sql(
    'stocks_df',
    engine,
    if_exists='replace'
)

10

#### Confirm the table was written in this other SQLite database instance.

In [11]:
# Confirm table.
engine.table_names()

C:\Users\admin\AppData\Local\Temp\ipykernel_17180\4150302383.py:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['stocks_df']

# Read a Table into a DataFrame like Pandas
>`pd.read_sql_table ( )` w/ parameters: **"table_name\", con =** connection_engine

In [12]:
sql_stocks_df = pd.read_sql_table(
    'stocks_df',
    con = engine
)

# Now, a new dataframe comes to.
sql_stocks_df

   index  UAVN  OPKS  WTUY
0      0    24    20    79
1      1    59    72    99
2      2    65    55    94
3      3    87    46    84
4      4    28    60    30
5      5    56    74    44
6      6    96    72    64
7      7    83    62    72
8      8    29    61    47
9      9    43    37    29

#### Review the resulting table.
>`Cleanup` data

In [13]:
# Observation: the index was stored in the SQLite since it recieved on instruction to ignore it, and it will ignore any action since the table in question has already existed in the database.
# Solution is to bypass database non-cooperation, write dataframe once more but this time with addional parameters: `dataframe.to_sql ( )`, w/ parameters: `index = False`, & 'if_exists = "replace"'

# Replace the existing table 'stocks_df'
stocks_df.to_sql(
    'stocks_df',
    engine,
    index= False,
    if_exists= 'replace'
)

# Read the table into a DataFrame
sql_stocks_df2 = pd.read_sql_table(
    'stocks_df',
    con= engine
)

# Display dataframe head() & tail()
display(sql_stocks_df2.head())
display(sql_stocks_df2.tail())

   UAVN  OPKS  WTUY
0    24    20    79
1    59    72    99
2    65    55    94
3    87    46    84
4    28    60    30

   UAVN  OPKS  WTUY
5    56    74    44
6    96    72    64
7    83    62    72
8    29    61    47
9    43    37    29

# Skill Drill --> create another instance of SQLite database.

In [14]:
# Create an SQLite database instance.
dat_string = 'sqlite:///'

# Create a database engine.
engine3 = sql.create_engine(
    dat_string
)

# Confirm database engine exits.
engine3

Engine(sqlite:///)

In [15]:
# Make a DataFrame to write tables into the new instance of SQLite database.

thumb_up_stocks = pd.DataFrame(
    {
        'OTEJ': np.random.randint(
            10,
            100,
            10
            )
        ,
        'JDKD': np.random.randint(
            10,
            100,
            10
            )
        ,
        'ETOP': np.random.randint(
            10,
            100,
            10
            )
        ,
        'SEEO': np.random.randint(
            10,
            100,
            10
            )
        ,
        'IEDP': np.random.randint(
            10,
            100,
            10
            )
        ,
        'GJSE': np.random.randint(
            10,
            100,
            10
            )
    }
)

thumb_up_stocks

   OTEJ  JDKD  ETOP  SEEO  IEDP  GJSE
0    88    80    63    26    73    98
1    69    92    74    12    17    28
2    25    70    10    84    76    95
3    28    51    45    53    14    36
4    89    77    77    98    19    77
5    47    37    31    61    65    24
6    92    60    75    19    29    42
7    41    79    45    21    15    94
8    81    15    56    83    13    66
9    14    47    52    19    19    58

In [16]:
# Write DataFrame into SQLite database.
thumb_up_stocks.to_sql(
    'thumb_up_stocks',
    engine3,
    index= False,
    if_exists= 'replace'
)

10

In [17]:
# Read a table from the SQLite database into s DataFrame.
sql_thumb_up_stocks_df = pd.read_sql_table(
    'thumb_up_stocks',
    con= engine3,
)

# Display dataframe head & tail.
display(sql_thumb_up_stocks_df.head())
display(sql_thumb_up_stocks_df.tail())

   OTEJ  JDKD  ETOP  SEEO  IEDP  GJSE
0    88    80    63    26    73    98
1    69    92    74    12    17    28
2    25    70    10    84    76    95
3    28    51    45    53    14    36
4    89    77    77    98    19    77

   OTEJ  JDKD  ETOP  SEEO  IEDP  GJSE
5    47    37    31    61    65    24
6    92    60    75    19    29    42
7    41    79    45    21    15    94
8    81    15    56    83    13    66
9    14    47    52    19    19    58

# This lesson involves Raw SQL

### Part 1
> See part two below

#### Recreate "thumbs up stocks" table:
> **echo** --> the engine to reveal the `SQL statement`.

In [18]:
# Create an instance of SQLite database.
datdat = 'sqlite:///'

# Create an engine which --> echoes
engine4 = sql.create_engine(
    datdat,
    echo = True
)

# Confirm the engine existence.
engine4

Engine(sqlite:///)

In [19]:
# Now, reveal or echo back the SQL statement that created the thumb up table.
thumb_up_stocks.to_sql(
    'thumb_up_stocks',
    engine4,
    index=False,
    if_exists='replace'
)

2023-02-08 16:28:15,770 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("thumb_up_stocks")
2023-02-08 16:28:15,774 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-08 16:28:15,776 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("thumb_up_stocks")
2023-02-08 16:28:15,778 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-08 16:28:15,782 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-02-08 16:28:15,783 INFO sqlalchemy.engine.Engine
CREATE TABLE thumb_up_stocks (
	"OTEJ" INTEGER,
	"JDKD" INTEGER,
	"ETOP" INTEGER,
	"SEEO" INTEGER,
	"IEDP" INTEGER,
	"GJSE" INTEGER
)


2023-02-08 16:28:15,786 INFO sqlalchemy.engine.Engine [no key 0.00133s] ()
2023-02-08 16:28:15,786 INFO sqlalchemy.engine.Engine COMMIT
2023-02-08 16:28:15,786 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-02-08 16:28:15,791 INFO sqlalchemy.engine.Engine INSERT INTO thumb_up_stocks ("OTEJ", "JDKD", "ETOP", "SEEO", "IEDP", "GJSE") VALUES (?, ?, ?, ?, ?, ?)
2023-02-08 16:28:15,791 INFO sqlalchemy.engine.Engine [generated in 0.00143s] ((88, 80, 63, 26, 73, 98), (69, 92, 74, 12, 17, 28), (25, 70, 10, 84, 76, 95), (28, 51, 45, 53, 14, 36), (89, 77, 77, 98, 19, 77), (47, 37, 31, 61, 65, 24), (92, 60, 75, 19, 29, 42), (41, 79, 45, 21, 15, 94), (81, 15, 56, 83, 13, 66), (14, 47, 52, 19, 19, 58))
2023-02-08 16:28:15,795 INFO sqlalchemy.engine.Engine COMMIT

10

___

### Part 2
> See part one above

#### Now that is revealed by echo engine, using the SQL statement recreate the thumb up table.

In [ ]:
create_table = """

CREATE TABLE thumb_up_stocks (
    "OTEJ" INTEGER, 
    "JDKD" INTEGER, 
    "ETOP" INTEGER, 
    "SEEO" INTEGER, 
    "IEDP" INTEGER, 
    "GJSE" INTEGER
)

"""
create_table

In [ ]:
# Execute the SQL statement using the: engine
engine4.execute(
    create_table
)

#### Let us change the SQL statement a bit.

###### Create new table using Raw SQL.

In [20]:
create_table1 = """

CREATE TABLE delicious_stocks (

    'EAT' BIGINT,
    'CAKE' BIGINT
)
"""

create_table1

"\n\nCREATE TABLE delicious_stocks (\n\n    'EAT' BIGINT,\n    'CAKE' BIGINT\n)\n"

In [21]:
# Now that the multiline string has been created, execute the SQL statement using the: engine
engine4.execute(
    create_table1
)

2023-02-08 16:28:15,823 INFO sqlalchemy.engine.Engine

CREATE TABLE delicious_stocks (

    'EAT' BIGINT,
    'CAKE' BIGINT
)

2023-02-08 16:28:15,823 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-08 16:28:15,831 INFO sqlalchemy.engine.Engine COMMIT

In [22]:
# Confirm that the SQL execute transaction was fulfilled by the database.
engine4.table_names()

2023-02-08 16:28:15,863 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2023-02-08 16:28:15,867 INFO sqlalchemy.engine.Engine [raw sql] ()

C:\Users\admin\AppData\Local\Temp\ipykernel_17180\3638058384.py:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine4.table_names()

['delicious_stocks', 'thumb_up_stocks']

In [23]:
# Now, read the table into the Pandas DataFrame.
pd.read_sql_table(
    'delicious_stocks',
    con= engine4
)

2023-02-08 16:28:15,877 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("delicious_stocks")
2023-02-08 16:28:15,881 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-08 16:28:15,883 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("delicious_stocks")
2023-02-08 16:28:15,885 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-08 16:28:15,886 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-02-08 16:28:15,889 INFO sqlalchemy.engine.Engine [raw sql] ('delicious_stocks',)
2023-02-08 16:28:15,889 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("delicious_stocks")
2023-02-08 16:28:15,896 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-08 16:28:15,896 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("delicious_stocks")
2023-02-08 16:28:15,896 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-08 16:28:15,896 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-02-08 16:28:15,904 INFO sqlalchemy.engine.Engine [raw sql] ('delicious_stocks',)
2023-02-08 16:28:15,904 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("delicious_stocks")
2023-02-08 16:28:15,904 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-08 16:28:15,904 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("delicious_stocks")
2023-02-08 16:28:15,904 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-08 16:28:15,912 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("delicious_stocks")
2023-02-08 16:28:15,912 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-08 16:28:15,912 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("delicious_stocks")
2023-02-08 16:28:15,912 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-08 16:28:15,920 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-02-08 16:28:15,922 INFO sqlalchemy.engine.Engine [raw sql] ('delicious_stocks',)
2023-02-08 16:28:15,928 INFO sqlalchemy.engine.Engine SELECT delicious_stocks."EAT", delicious_stocks."CAKE"
FROM delicious_stocks
2023-02-08 16:28:15,928 INFO sqlalchemy.engine.Engine [generated in 0.00219s] ()

Empty DataFrame
Columns: [EAT, CAKE]
Index: []

In [28]:
# Insert data into the table.
# First --> create a multiline string
insert_data = """
INSERT INTO delicious_stocks (
    (
        'EAT',
        'CAKE'
    )
    VALUES (
        ?,
        ?
    )
)

"""

In [29]:
# Second --> execute the SQL statement using the: engine
engine4.execute(
    insert_data,
    (
        (10,30),
        (20,40)
    )
)

2023-02-08 16:29:18,134 INFO sqlalchemy.engine.Engine
INSERT INTO delicious_stocks (
    (
        'EAT',
        'CAKE'
    )
    VALUES (
        ?,
        ?
    )
)


2023-02-08 16:29:18,143 INFO sqlalchemy.engine.Engine [raw sql] ((10, 30), (20, 40))
2023-02-08 16:29:18,143 INFO sqlalchemy.engine.Engine ROLLBACK

OperationalError: (sqlite3.OperationalError) near "(": syntax error
[SQL:
INSERT INTO delicious_stocks (
    (
        'EAT',
        'CAKE'
    )
    VALUES (
        ?,
        ?
    )
)

]
[parameters: ((10, 30), (20, 40))]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

___

In [ ]:
# Read data

In [1]:
read_all_data = """

SELECT`

'EAT', 'CAKE'

FROM

delicious_stocks

"""

In [2]:
engine4.execute(
    read_all_data
)

NameError: name 'engine4' is not defined